/**
 * Created by арсений on 20.11.2017.
 */
public class Alphabet {
    public static void main(String[] args) {
        String str = "абвгдеёжзийклмнопрстуфхцчшщъыьюя";
        System.out.println(Character.forDigit(1072, 8));
        for (int i = 0; i < str.length(); i++) {
            char ch = str.charAt(i);
            System.out.print(ch);
            int chCode = (int) ch;
            System.out.println(chCode);
            System.out.println("Значит\n" +
                    "ли\n" +
                    "это\n" +
                    ", \n" +
                    "что\n" +
                    "социальная\n" +
                    "психология\n" +
                    "  —  \n" +
                    "всего\n" +
                    "лишь\n" +
                    "синоним\n" +
                    "понятия\n" +
                    " «\n" +
                    "здравый\n" +
                    "смысл\n" +
                    "»? \n" +
                    "Социальную\n" +
                    "психологию\n" +
                    "критикуют\n" +
                    "с\n" +
                    "двух\n" +
                    "противоречащих\n" +
                    "друг\n" +
                    "другу\n" +
                    "позиций\n" +
                    ": \n" +
                    "одни\n" +
                    "   —   \n" +
                    "за\n" +
                    "тривиальность\n" +
                    ", \n" +
                    "подтверждающую\n" +
                    "очевидное\n" +
                    ", \n" +
                    "другие\n" +
                    " — \n" +
                    "за\n" +
                    "то\n" +
                    ", \n" +
                    "что\n" +
                    "она\n" +
                    "опасна\n" +
                    ", \n" +
                    "ибо\n" +
                    "ее\n" +
                    "достижения\n" +
                    "могут\n" +
                    "быть\n" +
                    "использованы\n" +
                    "для\n" +
                    "манипулирования\n" +
                    "людьми\n" +
                    ". \n" +
                    "Справедливо\n" +
                    "ли\n" +
                    "первое\n" +
                    "утверждение\n" +
                    ", \n" +
                    "т\n" +
                    ". \n" +
                    "е\n" +
                    ". \n" +
                    "правда\n" +
                    "ли\n" +
                    ", \n" +
                    "что\n" +
                    "социальная\n" +
                    "психология\n" +
                    "лишь\n" +
                    "придает\n" +
                    "определенную\n" +
                    "форму\n" +
                    "тому\n" +
                    ", \n" +
                    "что\n" +
                    "благодаря\n" +
                    "интуиции\n" +
                    "известно\n" +
                    "любому\n" +
                    "обывателю\n" +
                    "? ");

        }

//        System.out.println(Character.codePointAt()); System.out.println(Character.digit('а','я'));
    }
}
